Revit 2026 API

# StructuralAssetShearModulus Property

---

The shear modulus of the asset.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public XYZ ShearModulus { get; set; }
```
```vb
Public Property ShearModulus As XYZ
	Get
	Set
```
```cpp
public:
property XYZ^ ShearModulus {
	XYZ^ get ();
	void set (XYZ^ value);
}
```
```fsharp
member ShearModulus : XYZ with get, set
```

#### Property Value

XYZ

| Exception | Condition |
| --- | --- |
| ArgumentNullException | When setting this property: A non-optional argument was null |
| InapplicableDataException | When setting this property: the material type is wood. -or- When setting this property: the behavior is isotropic. |

This property cannot be used to set the shear modulus for wood-based and isotropic materials. For such assets, use setShearModulus instead. The value is in Newtons per foot meter (N/(ft · m)).

#### Reference

StructuralAsset Class

Autodesk.Revit.DB Namespace